const ho = ['0.', '1.', '2.', '3.', '4.', '5.', '6.', '7.', '8.', '9.', '10.', '11.', '12.', '13.', '14.', '15.', '16.', '17.', '18.', '19.', '20.', '21.', '22.', '23.', '24.', '25.', '26.', '27.', '28.', '29.', '30.', '31.', '32.', '33.', '34.', '35.', '36.', '37.', '38.', '39.', '40.', '41.', '42.', '43.', '44.', '45.', '46.', '47.', '48.', '49.', '50.'];
const hang = ['⓪', '①', '②', '③', '④', '⑤', '⑥', '⑦', '⑧', '⑨', '⑩', '⑪', '⑫', '⑬', '⑭', '⑮', '⑯', '⑰', '⑱', '⑲', '⑳', '㉑', '㉒', '㉓', '㉔', '㉕', '㉖', '㉗', '㉘', '㉙', '㉚', '㉛', '㉜', '㉝', '㉞', '㉟', '㊱', '㊲', '㊳', '㊴', '㊵', '㊶', '㊷', '㊸', '㊹', '㊺', '㊻', '㊼', '㊽', '㊾', '㊿'];
const mok = ['가.', '나.', '다.', '라.', '마.', '바.', '사.', '아.', '자.', '차.', '카.', '타.', '파.', '하.', '1)', '2)', '3)', '4)', '5)', '6)', '7)', '8)', '9)', '0)'];

module.exports = {
  state: (str) => {
    for (let i = 0; i < str.length; i++) {
      if (ho.indexOf(`${str[i]}${str[i+1]}`) !== -1) {
        return '호';
      } else if (mok.indexOf(`${str[i]}${str[i+1]}`) !== -1) {
        return '목';
      } else if (hang.indexOf(str[i]) !== -1) {
        return '항';
      } else return '조';
    };
  },
  chapSlice: (str) => {
    let tmp = str.slice(2);
    for (let i = 0; i < tmp.length; i += 1) {
      if (tmp[i] === ':') {
        return `${tmp.slice(0, i)}:0`;
      }
    }
  },
  arSlice: (str) => {
    let tmp = str.slice(1);
    let sliceResult;
    for (let i = 0; i < tmp.length; i += 1) {
      if (tmp[i] === ':') {
        sliceResult = `${tmp.slice(0, i)}:0`;
      };
    };
    if (tmp[tmp.length] - 1 !== '0') {
      return tmp;
    } else {
      return sliceResult;
    }
  },
};